#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/uit-cloud-computing/terraform-gcp/runs/run-oEPGXZpkdWSQYhXm

Waiting for the plan to start...

Terraform v1.3.5
on linux_amd64
Initializing plugins and modules...
module.cloud-nat.random_string.name_suffix: Refreshing state... [id=zdjufk]
google_container_cluster.primary: Refreshing state... [id=projects/uit-cloud-computing/locations/asia-southeast1-a/clusters/airflow-cluster]
google_compute_network.vpc_network: Refreshing state... [id=projects/uit-cloud-computing/global/networks/airflow-network]
google_compute_router.router: Refreshing state... [id=projects/uit-cloud-computing/regions/asia-southeast1/routers/airflow-nat-router]
google_compute_global_address.private_ip_address: Refreshing state... [id=projects/uit-cloud-computing/global/addresses/private-ip-address]
google_compute_firewall.airflow-allow-ssh: Refreshing state... [id=projects/uit-cloud-computing/global/firewalls/airflow-allow-ssh]
google_compute_firewall.airflow-allow-prometheus: Refreshing state... [id=projects/uit-cloud-computing/global/firewalls/airflow-allow-prometheus]
google_compute_firewall.airflow-allow-nfs: Refreshing state... [id=projects/uit-cloud-computing/global/firewalls/airflow-allow-nfs]
google_compute_firewall.allow-airflow: Refreshing state... [id=projects/uit-cloud-computing/global/firewalls/allow-airflow]
google_compute_firewall.airflow-allow-http: Refreshing state... [id=projects/uit-cloud-computing/global/firewalls/airflow-allow-http]
google_compute_firewall.airflow-allow-icmp: Refreshing state... [id=projects/uit-cloud-computing/global/firewalls/airflow-allow-icmp]
google_compute_firewall.airflow-allow-keda: Refreshing state... [id=projects/uit-cloud-computing/global/firewalls/airflow-allow-keda]
google_compute_firewall.airflow-allow-https: Refreshing state... [id=projects/uit-cloud-computing/global/firewalls/airflow-allow-https]
module.cloud-nat.google_compute_router_nat.main: Refreshing state... [id=uit-cloud-computing/asia-southeast1/airflow-nat-router/airflow-nat-config]
google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Fuit-cloud-computing%2Fglobal%2Fnetworks%2Fairflow-network:servicenetworking.googleapis.com]
google_container_node_pool.airflow-core: Refreshing state... [id=projects/uit-cloud-computing/locations/asia-southeast1-a/clusters/airflow-cluster/nodePools/airflow-core]
google_container_node_pool.airflow-k8s-workers: Refreshing state... [id=projects/uit-cloud-computing/locations/asia-southeast1-a/clusters/airflow-cluster/nodePools/airflow-k8s-workers]
google_container_node_pool.airflow-webserver: Refreshing state... [id=projects/uit-cloud-computing/locations/asia-southeast1-a/clusters/airflow-cluster/nodePools/airflow-webserver]
google_container_node_pool.airflow-celery-workers: Refreshing state... [id=projects/uit-cloud-computing/locations/asia-southeast1-a/clusters/airflow-cluster/nodePools/airflow-celery-workers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_node_pool.airflow-core must be replaced
-/+ resource "google_container_node_pool" "airflow-core" {
      ~ id                  = "projects/uit-cloud-computing/locations/asia-southeast1-a/clusters/airflow-cluster/nodePools/airflow-core" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/uit-cloud-computing/zones/asia-southeast1-a/instanceGroupManagers/gke-airflow-cluster-airflow-core-eb9aa616-grp",
        ] -> (known after apply)
      ~ location            = "asia-southeast1-a" -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "airflow-core"
      + name_prefix         = (known after apply)
      ~ node_count          = 1 -> (known after apply)
      ~ node_locations      = [
          - "asia-southeast1-a",
        ] -> (known after apply)
      + operation           = (known after apply)
      ~ project             = "uit-cloud-computing" -> (known after apply)
      ~ version             = "1.23.12-gke.100" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ management {
          ~ auto_repair  = true -> (known after apply)
          ~ auto_upgrade = true -> (known after apply)
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "UBUNTU_CONTAINERD" -> "ubuntu_containerd"
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "t2d-standard-8" -> "t2d-standard-4" # forces replacement
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          ~ service_account   = "default" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          + workload_metadata_config {
              + mode          = (known after apply)
              + node_metadata = (known after apply)
            }
        }

      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # google_container_node_pool.airflow-k8s-workers will be created
  + resource "google_container_node_pool" "airflow-k8s-workers" {
      + cluster                     = "projects/uit-cloud-computing/locations/asia-southeast1-a/clusters/airflow-cluster"
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = (known after apply)
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "airflow-k8s-workers"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + autoscaling {
          + max_node_count = 2
          + min_node_count = 0
        }

      + management {
          + auto_repair  = (known after apply)
          + auto_upgrade = (known after apply)
        }

      + network_config {
          + create_pod_range    = (known after apply)
          + pod_ipv4_cidr_block = (known after apply)
          + pod_range           = (known after apply)
        }

      + node_config {
          + disk_size_gb      = 30
          + disk_type         = "pd-ssd"
          + guest_accelerator = (known after apply)
          + image_type        = "ubuntu_containerd"
          + labels            = {
              + "purpose" = "k8s_worker"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "c2-standard-4"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
              + "https://www.googleapis.com/auth/trace.append",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = true
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "cloud.google.com/gke-spot"
                  + value  = "true"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
          + strategy        = (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }
    }

  # google_container_node_pool.airflow-webserver will be created
  + resource "google_container_node_pool" "airflow-webserver" {
      + cluster                     = "projects/uit-cloud-computing/locations/asia-southeast1-a/clusters/airflow-cluster"
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = (known after apply)
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "airflow-webserver"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + autoscaling {
          + max_node_count = 2
          + min_node_count = 1
        }

      + management {
          + auto_repair  = (known after apply)
          + auto_upgrade = (known after apply)
        }

      + network_config {
          + create_pod_range    = (known after apply)
          + pod_ipv4_cidr_block = (known after apply)
          + pod_range           = (known after apply)
        }

      + node_config {
          + disk_size_gb      = 30
          + disk_type         = "pd-standard"
          + guest_accelerator = (known after apply)
          + image_type        = "ubuntu_containerd"
          + labels            = {
              + "purpose" = "webserver"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "t2d-standard-2"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
              + "https://www.googleapis.com/auth/trace.append",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = true
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "cloud.google.com/gke-spot"
                  + value  = "true"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
          + strategy        = (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }
    }

  # google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "airflow-database"
      + name      = "airflow-db"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # google_sql_database_instance.postgres_instance will be created
  + resource "google_sql_database_instance" "postgres_instance" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_13"
      + deletion_protection           = true
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "airflow-database"
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "asia-southeast1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy           = (known after apply)
          + authorized_gae_applications = (known after apply)
          + availability_type           = (known after apply)
          + crash_safe_replication      = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = 10
          + disk_type                   = "PD_SSD"
          + pricing_plan                = "PER_USE"
          + replication_type            = (known after apply)
          + tier                        = "db-custom-1-4096"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + location                       = "asia-southeast1"
              + start_time                     = "20:00"
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "projects/uit-cloud-computing/global/networks/airflow-network"
            }

          + location_preference {
              + zone = "asia-southeast1-a"
            }
        }
    }

  # google_sql_user.users will be created
  + resource "google_sql_user" "users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "airflow-database"
      + name     = (sensitive value)
      + password = (sensitive value)
      + project  = (known after apply)
    }

Plan: 6 to add, 0 to change, 1 to destroy.


```

</details>

*Pushed by: @thoaih, Action: `pull_request`*